Итоговый_проект_3_для_мобильного_приложения/src/Documents/Доработка_Доставка/Доработка_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доработка_Доставка</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоставок_Доработка</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Итоговый_проект_3_для_мобильного_приложения/src/Documents/Доработка_Доставка/ObjectModule.bsl
// {{Слукина М.Н.  заполнение реквизита Ответственный текущим пользователем. реализовать алгоритм заполнения документа

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти  

#КонецЕсли

	// }}
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Реализуйте регистрацию документа «Доставка» на всех узлах плана обмена, 
	//у которых значение реквизита «Пользователь» заполнено и соответствует 
	//значению реквизита «Ответственный документа»  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
 
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ОбменСМобильнымПриложением.Ссылка КАК Ссылка
	              |ИЗ
	              |	ПланОбмена.ОбменСМобильнымПриложением КАК ОбменСМобильнымПриложением
	              |ГДЕ
	              |	ОбменСМобильнымПриложением.Пользователь = &Пользователь
	              |	И НЕ ОбменСМобильнымПриложением.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Пользователь", Ответственный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	КонецЦикла; 
				  
КонецПроцедуры
